gstroe/Harmony/gfx/graphics_showcase/firmware/src/system_config/pic32mz_ef_sk_meb2/framework/driver/gfx/controller/lcc/drv_gfx_lcc_generic.c
  Input:
          instance - driver instance
          *color - start of the array
                  x - x coordinate of the start point.
                  y - y coordinate of the end point.
                  count - number of pixels
  Output:
         handle to the number of pixels remaining
*/
void  DRV_GFX_LCC_PixelArrayPut(GFX_COLOR *color, uint16_t x, uint16_t y, uint16_t count, uint16_t lineCount)
{
    _frameAddress = (uint32_t)(((y)*(DISP_HOR_RESOLUTION))+(x));

    while(lineCount)
    {
       _framePoint = (uint16_t*)_ebiBaseAddress + (_frameAddress);
       for(_pixelRendercount = count; _pixelRendercount > 0; _pixelRendercount--)
       {
			/*Suspend DMA Trigger*/
			LCCSaveData();
			if(_pixelRendercount > 8) //Write 8 pixels at once
			{
				*_framePoint++ = *color++;
				*_framePoint++ = *color++;
				*_framePoint++ = *color++;
				*_framePoint++ = *color++;
				*_framePoint++ = *color++;
				*_framePoint++ = *color++;
				*_framePoint++ = *color++;
				_pixelRendercount -= 7;
				_frameAddress += 7;
			}

			*_framePoint++ = *color++;
			LCCRecoverData();
			_frameAddress++;
       }
       _frameAddress += (DISP_HOR_RESOLUTION - count);
       lineCount--;
    }
}

// *****************************************************************************
/*
  Function: uint16_t*  DRV_GFX_LCC_PixelArrayGet(uint16_t *color, uint16_t x, uint16_t y, uint16_t count)

  Summary:
    outputs an array of pixels of length count starting at *color

  Description:
    none

  Input:
          instance - driver instance
          *color - start of the array
                  x - x coordinate of the start point.
                  y - y coordinate of the end point.
                  count - number of pixels
  Output:
         handle to the number of pixels remaining
*/
uint16_t*  DRV_GFX_LCC_PixelArrayGet(GFX_COLOR *color, uint16_t x, uint16_t y, uint16_t count)
{
     _frameAddress =  (uint32_t)(((y)*(DISP_HOR_RESOLUTION))+(x));
	_framePoint = (uint16_t*)_ebiBaseAddress + (_frameAddress);
    while(count)
    {
		/*Suspend DMA Trigger*/
		LCCSaveData();
        if(count > 4) // Read 4 pixels at once
        {
            *color++ = *_framePoint++;
            count -= 3;
            *color++ = *_framePoint++;
            _frameAddress += 3;
            *color++ = *_framePoint++;
        }
        *color++ = *_framePoint++;
        LCCRecoverData();

        _frameAddress++;
        count--;
	}
    return 0;
}


uint16_t prevaddr;

inline void LCCSaveData(void)
{
    while(DrawCount > PIXEL_DRAW_PER_DMA_TX);
    PLIB_TMR_Stop(DRV_GFX_LCC_TMR_INDEX);
    while(PMMODEbits.BUSY == 1); //WAIT for DMA transfer to be suspended
    CFGEBIA = 0x000fffff;
    CFGEBIC = 0x00002003;
}

inline void LCCRecoverData(void)
{
    CFGEBIA = 0;
    CFGEBIC = 0;
    PLIB_TMR_Start(DRV_GFX_LCC_TMR_INDEX);
    DrawCount++;
}

// *****************************************************************************
/* Function:
    SYS_STATUS DRV_GFX_LCC_Status ( SYS_MODULE_OBJ object )

  Summary:
    Returns status of the specific module instance of the Driver module.

  Description:
    This function returns the status of the specific module instance disabling its
    operation (and any hardware for driver modules).

  PreCondition:
    The DRV_GFX_LCC_Initialize function should have been called before calling
    this function.

  Parameters:
    object          - DRV_GFX_LCC object handle, returned from DRV_GFX_LCC_Initialize

  Returns:
    SYS_STATUS_READY    Indicates that any previous module operation for the
                        specified module has completed

    SYS_STATUS_BUSY     Indicates that a previous module operation for the
                        specified module has not yet completed

    SYS_STATUS_ERROR    Indicates that the specified module is in an error state
*/

SYS_STATUS DRV_GFX_LCC_Status ( SYS_MODULE_OBJ object )
{
    DRV_GFX_LCC_OBJ *dObj = (DRV_GFX_LCC_OBJ*)object;
    return ( dObj->state );

} /* SYS_TMR_Status */

